[{
    "title": "根据《黄河防汛抗旱应急预案（试行）》、《河南省黄河流域防洪预案（伊洛河）》，以及洛阳市、郑州市等市县区各级防汛抢险预案，以及预报调度风险分析结果建议采取如下响应措施：",
    "values": 
    {
        "1": "黄河防总总指挥或常务副总指挥坐镇指挥黄河抗洪工作，主持抗洪抢险会商会研究部署坑洪抢险工作。各级防汛指挥机构领导要坐阵指挥。",
        "2": "河南省、洛阳市、郑州市等省区防汛抗旱指挥机构负责同志主持会商，具体安排防汛工作:根据预案做好巡堤查险、抗洪抢险、群众转移安置等抗洪救灾工作。",
        "3": "各防汛指挥机构组织军民、机动抢险队坚守大堤，查险除险，防汛物资储备单位要做好物资保障。",
        "4": "若伊洛河上游仍有较大来水，洪水下泄不畅，水位继续上涨，威胁到洛阳、偃师城区、大唐首阳电厂和陇海铁路的安全或夹河滩防洪大堤全线危急时，报请上级防汛指挥部门批准后，从伊河右岸杨村段和洛河右岸岳滩村段爆破分洪。",
        "5": "当前暂无堤防淹没。"
    }
},{
    "title": "根据陆浑水库、故县水库防汛抢险应急预案，建议采取如下响应措施：",
    "values": 
    {
        "1": "水库防汛指挥部指挥长主持会商，部署指挥工作。",
        "2": "水库防办密切监视突发事件变化，做好预测预报，并加强对重点部位和重要措施安全保卫工作，组织好人员转移工作。",
        "3": "防汛物资储备单位要做好物资保障，抢险队伍全力抢险。"
    }
},{
    "title": "当发生险情时，请根据预案及时开展抢险工作：",
    "subtitles":[
        "坝基渗流破坏发生管涌时：", "上游坝坡发生滑坡：", "泄水闸门突发性故障：", "临水崩塌："
    ],
    "values": 
    {
        "坝基渗流破坏发生管涌时：": "（1）报告上级防指，全开闸门泄水，最大限度降低水位。 \n（2）在采取上述措施的同时进行全力抢护，抢护中分两步同时进行，第一步应派监测人员查探坝前水情，确定管涌进口位置，位置确定后迅速用装土麻袋向漏水点投抛，如果投抛后下游翻泉有减弱的情况，证明上游止漏有效，直至漏量较小或不漏为止。第二步与第一步同时进行，对下游冒水点区实施压坝脚做反滤处理，首先在翻泉点、区用麻袋或编织袋装砂料无缝密铺，压住漏水点、区，压铺砂袋厚度应不小于30cm，范围为漏水点、区边界线以外不小于3m的区域全部施铺；铺设砂袋的实施过程按流水作业法用麻袋或编织袋装碎石子无缝密铺压住砂袋，厚度不小于30cm，范围同砂袋。碎石子袋压好后，亦按流水线法在碎石子袋上加压大块石一层，如果压不住，应立即加大块石厚度，直至压住为止。",
        "上游坝坡发生滑坡：": "（1）滑坡发生后，必须立即抢护，以免风浪冲击破坏斜墙。 \n（2）在抢护过程中，应严禁人为对粘土斜墙表面造成损伤，不得在斜墙表面打桩、修路修阶、人行践踏、抛料滚石等。 \n（3）抢护方法：第一，用麻袋或编织袋装砂料从滑坡部位的左右两侧沿斜墙面实施无缝密铺，向中心合拢，在铺垫过程中，若遇散落在斜墙面上的砼块或较大块石可渐次清除，这样可避免人为踏伤斜墙表面。砂袋铺垫厚度应不小于30cm。第二，采用流水做业法再铺垫一层袋装碎石子，厚度亦不小于30cm。第三，紧接着在碎石子袋上迅速压砌大块石，也可用砼块体，严防风浪冲击破坏反滤料层。 \n（4）在遇到特别紧急，来不及采用上述方法抢护时，可以用透水土工布铺于滑坡表面，周围用大石块或砂石袋压紧，洪水退后再处理。 \n（5）抢护完成后应专人监视，险情过后拆除临时抢护物并按原设计及时修复。",
        "泄水闸门突发性故障：": "（1）电源中断时的应急处理 在闸门启闭中，电源供给优先顺序为： ①水库电站自发电供电； ②备用的柴油发电机组供电； ③国家电网系统电供电。 \n（2）闸门机电设施突发性故障发生时的应急处理 ①若溢洪道、泄洪洞闸门机电设施突发故障启闭受阻，因启闭力巨大，均无手摇机构，可按下述应急措施处理：其一，立即请示上级防指使灌溉洞提前投入泄洪，减少一部分库水位上涨的压力，同时组织机电工作人员或聘请专家抢修，使其恢复启用；其二，库水位上涨仍有可能造成漫坝威胁时，应按超标准洪水抢险方案进行抢护。 ②若灌溉洞、输水洞闸门机电设施突发故障启闭受阻，应迅速组织机电工作人员或聘请专家进行抢修，使其恢复启用。",
        "临水崩塌：": "（1）临水崩塌险情可能发生的部位机电管理中心建在弃垫的虚土区，如遇到高水位运用时，受风浪的冲击很可能造成院南填土坡面大量塌方，将危及机组安全。\n（2） 抢护原则:缓流消浪，增强抗冲能力；不要在坡面、坡顶堆放重物或打桩，以免加快崩塌；对淘刷滑动引起的险情，要先稳定坡脚，再处理岸坡。 \n（3）抢护方法 ①挂柳挂枕 选择枝繁叶茂的柳树头，将根部系在岸坡顶部的木桩上，在树梢枝杈上捆扎块石，顺坡推入水中消浪，树棵间距和悬挂深度要根据流势和崩塌程度而定，也可将柳树头的根部悬挂大石块或土袋固定。然后按照由深到浅的顺序依次抛沉。 还可用粗稍料，捆成直径0.5～0.8m，长6～8m的稍枕，两端用绳子系于坡顶的木桩上，推入水中消浪。风浪较大时，可将稍枕连起来，做成枕排防浪。 ②竹木排防浪 当水库风浪较大时，可将竹木条分层叠扎成竹木排，用绳拴在坡顶的木桩上，同时，排下坠一块石或土袋，以稳定和调整排位。排体和坡体之间，要有一定的距离，以免撞击坡体。排体较大时可抛铁锚定位。 ③护脚固基 临水护脚固基，最常用的办法是散抛块石。对于水深流急的抢护，可用铅丝笼、竹笼、柳条笼装石抛投。 ④土工织物防冲 先将坡面进行平整和清理，把拼好的土工布或篷布铺在平整好的坡面上，膜布高出洪水位，并在膜布上压盖砼块或土袋，以抵抗风浪冲刷。"
    }
}
]