# coding=utf-8

import pprint
from django.forms import model_to_dict
from pydantic import BaseModel
from typing import List
import os
import json
from docx.shared import Mm
from docx import Document
from datetime import datetime
from datetime import date
import pandas as pd
from io import StringIO
import requests
import json
import codecs
import logging
from mainapp.yaapp.base_data import BaseDataFactory
from mainapp.yaapp import (get_ddfad_data, oauth_login, oauth_login_new,generate_rainfall_report,get_rainfall_data_day,format_hydrometric_data,format_reservoir_data,
                   query_zx_reservoir_data,get_weather_warning,get_access_token, get_formatted_jlyb_data, get_max_rainfall_station, get_rain_analysis,plot_yuliangmian)
# from mainapp.yaapp.base_data import BaseDataFactory
# from mainapp.yaapp import (get_ddfad_data, oauth_login, oauth_login_new,generate_rainfall_report,get_rainfall_data_day,format_hydrometric_data,format_reservoir_data,
#                    query_zx_reservoir_data,get_weather_warning,get_access_token, get_formatted_jlyb_data, get_max_rainfall_station, get_rain_analysis,plot_yuliangmian)
logger = logging.getLogger(__name__)

class YLHDataFactory(BaseDataFactory):

    def __init__(self, dataType=0):
        super().__init__(dataType)


    def getYuQingData(self):
        """
            获取雨情数据
        """
        #auth_token = oauth_login()
        auth_token = oauth_login_new()
        status, data = get_rainfall_data_day(auth_token=auth_token)
        report = generate_rainfall_report(response_data=data)
        now = datetime.now()
        month_day = now.strftime("%m月%d日")
        # 构造表名
        hdsq_table_name = f"{month_day}8时伊洛河干流重要站水情"
        code, res_hdsq = format_hydrometric_data(auth_token)
        # 获取当前时间并格式化
        res_sksq = format_reservoir_data(auth_token)
        now = datetime.now()
        month_day = now.strftime("%m月%d日")
        # 构造表名
        sksq_table_name = f"{month_day}8时水库蓄水情况表"
        zxsksq = query_zx_reservoir_data()
        print("降雨数据：", report)
        max_rainfall_station = get_max_rainfall_station(data['data'])
        logger.info(f"最大降雨站：, {max_rainfall_station}")
        jiangyu_token = get_access_token()
        rain_geojson_result = get_rain_analysis(auth_token=jiangyu_token)
        plot_yuliangmian(rain_geojson_result, max_rainfall_station)
        return {"yuqing": report,"hdsq_table_name": hdsq_table_name,"hdsq": res_hdsq["hdsq"],"sksq_table_name": sksq_table_name,"sksq":res_sksq["sksq"],"zxsksq":zxsksq}

    def getHedaoShuiQingData(self):
        """
            获取河道水情数据
        """
        # auth_token = oauth_login()
        # code, res_hdsq = format_hydrometric_data(auth_token)
        # # 获取当前时间并格式化
        # now = datetime.now()
        # month_day = now.strftime("%m月%d日")
        # # 构造表名
        # hdsq_table_name = f"{month_day}8时伊洛河干流重要站水情"
        # #print("res:",res)
        return {}#{"hdsq_table_name": hdsq_table_name,"hdsq": res_hdsq["hdsq"]}

    def getShuiKuShuiQingData(self):
        """
            获取水库水情数据
        """
        # auth_token = oauth_login()
        # res_sksq = format_reservoir_data(auth_token)
        # now = datetime.now()
        # month_day = now.strftime("%m月%d日")
        # # 构造表名
        # sksq_table_name = f"{month_day}8时水库蓄水情况表"
        # zxsksq=query_zx_reservoir_data()
        return {}#{"sksq_table_name": sksq_table_name,"sksq":res_sksq["sksq"],"zxsksq":zxsksq}

    def getBaoYuYuJing(self):
        token = get_access_token()
        result = get_weather_warning(auth_token=token)
        byyj = result["description"]
        jlyb  = get_formatted_jlyb_data(auth_token=token)
        return {"byyj": byyj,"ylhjyyb": jlyb}

    def getGongQingXianQingData(self):
        """
            工情险情
        """
        return {"xianqing": "调水调沙以来，黄河下游累计有39处工程123道坝出险214次，抢险用石5.08万方，耗资1723.27万元。其中：河南河段累计有30处工程107道坝出险197次，抢险用石4.09万方，耗资1354.85万元；山东段累计有9处工程17道坝出险18次，抢险用石0.99立方米，耗资377.81万元。",
            "jyyb_desc": "7月24日至7月27日，伊洛河流域中游大部地区降小雨，其中伊河下游洛河部分地区大部降中到大雨、部分站暴雨，最大点雨量伊洛河古城站87毫米。",
    "jyyb_imgs":[
        {"url": "1.png", "desc": ""},
        {"url": "2.png", "desc": ""},
        {"url": "3.png", "desc": ""},
        {"url": "4.png", "desc": ""},
        {"url": "5.png", "desc": ""},
        {"url": "6.png", "desc": ""},
        {"url": "7.png", "desc": ""}
    ],
    "yuliang_img":"yuliang.png",
#     "ylhjyyb": [
#     {"区域": "龙三干流", "0-24小时": "3-8", "24-48小时": "1-5", "48-72小时": "1-5"},
#     {"区域": "三花干流", "0-24小时": "0-4", "24-48小时": "0-4", "48-72小时": "1-5"},
#     {"区域": "伊、洛河", "0-24小时": "0-3", "24-48小时": "1-5", "48-72小时": "1-5"},
#     {"区域": "沁 河", "0-24小时": "1-5", "24-48小时": "0-3", "48-72小时": "0-4"},
#     {"区域": "黄河下游", "0-24小时": "1-5", "24-48小时": "0-3", "48-72小时": "1-5"}
# ],
    "qjsyj": "预计，7月24日，伊河、洛河局地有短时强降水，小时雨量20-40毫米。",
    "jlyb": "jlyb.png",
    "hhfloodforecast": [
            {"日期": "2024/11/06", "唐乃亥": 1000, "龙刘区间": 340, "刘兰区间": 240, "合计": 1580},
            {"日期": "2024/11/07", "唐乃亥": 960, "龙刘区间": 330, "刘兰区间": 230, "合计": 1520},
            {"日期": "2024/11/08", "唐乃亥": 930, "龙刘区间": 330, "刘兰区间": 230, "合计": 1490},
            {"日期": "2024/11/09", "唐乃亥": 930, "龙刘区间": 320, "刘兰区间": 220, "合计": 1470},
            {"日期": "2024/11/10", "唐乃亥": 900, "龙刘区间": 320, "刘兰区间": 220, "合计": 1440},
            {"日期": "2024/11/11", "唐乃亥": 860, "龙刘区间": 310, "刘兰区间": 210, "合计": 1380},
            {"日期": "2024/11/12", "唐乃亥": 820, "龙刘区间": 300, "刘兰区间": 210, "合计": 1330}
        ],
    "goodsTable": [
    {
        "类别": "抢险料物",
        "物资品种": "袋类(条)",
        "目前库存数量": 26000,
        "2004年储备定额标准（一类项）": 26000,
        "库存料物差额数": 0
    },
    {
        "类别": "抢险料物",
        "物资品种": "土工布（m²）",
        "目前库存数量": 8000,
        "2004年储备定额标准（一类项）": 10800,
        "库存料物差额数": -2800
    },
    {
        "类别": "抢险料物",
        "物资品种": "土工膜（m²）",
        "目前库存数量": 5400,
        "2004年储备定额标准（一类项）": None,
        "库存料物差额数": None
    },
    {
        "类别": "抢险料物",
        "物资品种": "砂石料（m³）",
        "目前库存数量": 8026,
        "2004年储备定额标准（一类项）": 2772,
        "库存料物差额数": 5254
    },
    {
        "类别": "抢险料物",
        "物资品种": "块石（m³）",
        "目前库存数量": 2677,
        "2004年储备定额标准（一类项）": 2520,
        "库存料物差额数": 157
    },
    {
        "类别": "抢险料物",
        "物资品种": "铅丝（kg）",
        "目前库存数量": 21000,
        "2004年储备定额标准（一类项）": 2700,
        "库存料物差额数": 18300
    },
    {
        "类别": "抢险料物",
        "物资品种": "桩木（m³）",
        "目前库存数量": 16,
        "2004年储备定额标准（一类项）": 5.1,
        "库存料物差额数": 10.9
    },
    {
        "类别": "救生器材",
        "物资品种": "救生衣(件)",
        "目前库存数量": 270,
        "2004年储备定额标准（一类项）": 270,
        "库存料物差额数": 0
    },
    {
        "类别": "救生器材",
        "物资品种": "抢险救生舟(艘)",
        "目前库存数量": 3,
        "2004年储备定额标准（一类项）": 4,
        "库存料物差额数": -1
    },
    {
        "类别": "小型抢险机具",
        "物资品种": "发电机组（kw）",
        "目前库存数量": 55.5,
        "2004年储备定额标准（一类项）": 54,
        "库存料物差额数": 1.5
    },
    {
        "类别": "小型抢险机具",
        "物资品种": "便携式工作灯(只)",
        "目前库存数量": 51,
        "2004年储备定额标准（一类项）": 51,
        "库存料物差额数": 0
    },
    {
        "类别": "小型抢险机具",
        "物资品种": "投光灯(只)",
        "目前库存数量": 4,
        "2004年储备定额标准（一类项）": 4,
        "库存料物差额数": 0
    },
    {
        "类别": "小型抢险机具",
        "物资品种": "电缆（m）",
        "目前库存数量": 832,
        "2004年储备定额标准（一类项）": 819,
        "库存料物差额数": 13
    },
    {
        "类别": "其他",
        "物资品种": "汽油(吨)",
        "目前库存数量": 0,
        "2004年储备定额标准（一类项）": None,
        "库存料物差额数": None
    },
    {
        "类别": "其他",
        "物资品种": "柴油(吨)",
        "目前库存数量": 0,
        "2004年储备定额标准（一类项）": None,
        "库存料物差额数": None
    },
    {
        "类别": "其他",
        "物资品种": "水泥(吨)",
        "目前库存数量": 0,
        "2004年储备定额标准（一类项）": None,
        "库存料物差额数": None
    },
    {
        "类别": "其他",
        "物资品种": "铁锹(张)",
        "目前库存数量": 250,
        "2004年储备定额标准（一类项）": None,
        "库存料物差额数": None
    },
    {
        "类别": "其他",
        "物资品种": "洋镐(把)",
        "目前库存数量": 100,
        "2004年储备定额标准（一类项）": None,
        "库存料物差额数": None
    },
    {
        "类别": "其他",
        "物资品种": "斗车(辆)",
        "目前库存数量": 50,
        "2004年储备定额标准（一类项）": None,
        "库存料物差额数": None
    }
],
    "zzbzTable": [
    {
        "序号": 1,
        "单位": "洛阳市人民政府",
        "责任人": "李刚",
        "职务": "指挥长、副市长",
        "联系方式": "15903795977"
    },
    {
        "序号": 2,
        "单位": "陆浑水库运行中心",
        "责任人": "游巍亭",
        "职务": "常务副指挥长、主任",
        "联系方式": "13598955762"
    },
    {
        "序号": 3,
        "单位": "洛阳军分区",
        "责任人": "王更军",
        "职务": "副指挥长、副司令员",
        "联系方式": "13309881627"
    },
    {
        "序号": 4,
        "单位": "嵩县人民政府",
        "责任人": "任庆鹏",
        "职务": "副指挥长、县长",
        "联系方式": "18838813528"
    },
    {
        "序号": 5,
        "单位": "伊川县人民政府",
        "责任人": "王智朋",
        "职务": "副指挥长、县长",
        "联系方式": "68366512"
    },
    {
        "序号": 6,
        "单位": "洛阳市应急管理局",
        "责任人": "赵红彬",
        "职务": "副局长",
        "联系方式": "13783185689"
    },
    {
        "序号": 7,
        "单位": "洛阳市公安局",
        "责任人": "封民",
        "职务": "党委副书记",
        "联系方式": "63133600"
    },
    {
        "序号": 8,
        "单位": "洛阳市水利局",
        "责任人": "李向阳",
        "职务": "副局长",
        "联系方式": "63330519"
    },
    {
        "序号": 9,
        "单位": "洛阳市民政局",
        "责任人": "齐成喜",
        "职务": "副局长",
        "联系方式": "13525971103"
    },
    {
        "序号": 10,
        "单位": "洛阳市交通运输局",
        "责任人": "曹永利",
        "职务": "党组成员",
        "联系方式": "63239979"
    },
    {
        "序号": 11,
        "单位": "洛阳市驻军96762部队",
        "责任人": "周志立",
        "职务": "副旅长",
        "联系方式": "66822990"
    },
    {
        "序号": 12,
        "单位": "洛阳市粮食和物资储备局",
        "责任人": "李毅军",
        "职务": "副局长",
        "联系方式": "18638800257"
    },
    {
        "序号": 13,
        "单位": "中国联合网络通信有限公司洛阳公司",
        "责任人": "尚明",
        "职务": "总经理",
        "联系方式": "15637902101"
    },
    {
        "序号": 14,
        "单位": "国网洛阳供电公司",
        "责任人": "方涛",
        "职务": "防办主任",
        "联系方式": "13903795690"
    },
    {
        "序号": 15,
        "单位": "嵩县人民政府",
        "责任人": "张宏业",
        "职务": "副县长",
        "联系方式": "66311928"
    },
    {
        "序号": 16,
        "单位": "伊川县人民政府",
        "责任人": "蒋艳萍",
        "职务": "统战部长",
        "联系方式": "68366115"
    },
    {
        "序号": 17,
        "单位": "嵩县武装部",
        "责任人": "王海武",
        "职务": "部长",
        "联系方式": "66312041"
    },
    {
        "序号": 18,
        "单位": "伊川县武装部",
        "责任人": "夏瑞",
        "职务": "部长",
        "联系方式": "69870760"
    },
    {
        "序号": 19,
        "单位": "陆浑水库运行中心",
        "责任人": "冯新军",
        "职务": "副主任",
        "联系方式": "13707691677"
    },
    {
        "序号": 20,
        "单位": "陆浑水库运行中心",
        "责任人": "张鹏波",
        "职务": "总工程师",
        "联系方式": "13461025163"
    }
],
    "dwbzTable": [
    {
        "县名": "偃师",
        "专业抢险人数（名）": 200,
        "群众抢险人数（名）": 13000,
        "抢险突击队（名）": 50,
        "合计（名）": 13250
    },
    {
        "县名": "伊川",
        "专业抢险人数（名）": 2260,
        "群众抢险人数（名）": 23200,
        "抢险突击队（名）": 400,
        "合计（名）": 25860
    },
    {
        "县名": "燕县",
        "专业抢险人数（名）": None,
        "群众抢险人数（名）": 2423,
        "抢险突击队（名）": 60,
        "合计（名）": 2483
    },
    {
        "县名": "童阳",
        "专业抢险人数（名）": 22,
        "群众抢险人数（名）": 9650,
        "抢险突击队（名）": 22,
        "合计（名）": 9694
    },
    {
        "县名": "洺宁",
        "专业抢险人数（名）": 1800,
        "群众抢险人数（名）": 3600,
        "抢险突击队（名）": 180,
        "合计（名）": 5580
    },
    {
        "县名": "市区",
        "专业抢险人数（名）": None,
        "群众抢险人数（名）": None,
        "抢险突击队（名）": 15,
        "合计（名）": 15
    }
],
    "jsbzTable": [
    {
      "姓名": "游巍亭",
      "单位": "河南省陆浑水库运行中心",
      "职务": "主任、高工",
      "联系方式": "18638810088"
    },
    {
      "姓名": "冯新军",
      "单位": "河南省陆浑水库运行中心",
      "职务": "副主任、教高",
      "联系方式": "13698868327"
    },
    {
      "姓名": "张鹏焱",
      "单位": "河南省陆浑水库运行中心",
      "职务": "教高",
      "联系方式": "13461025163"
    },
    {
      "姓名": "刘小军",
      "单位": "河南省陆浑水库运行中心",
      "职务": "教高",
      "联系方式": "13623796367"
    },
    {
      "姓名": "李建立",
      "单位": "河南省陆浑水库运行中心",
      "职务": "高工",
      "联系方式": "15838827698"
    },
    {
      "姓名": "郝敬伟",
      "单位": "河南省陆浑水库运行中心",
      "职务": "教高",
      "联系方式": "13783790258"
    },
    {
      "姓名": "韩明海",
      "单位": "河南省陆浑水库运行中心",
      "职务": "高工",
      "联系方式": "13613882828"
    },
    {
      "姓名": "齐润利",
      "单位": "河南省陆浑水库运行中心",
      "职务": "高工",
      "联系方式": "13663885857"
    },
    {
      "姓名": "李滔",
      "单位": "河南省陆浑水库运行中心",
      "职务": "一级技师",
      "联系方式": "18337915788"
    }
  ],
    "txbzTable": [
    {
      "单位名称": "市委办",
      "联系电话": "64353699"
    },
    {
      "单位名称": "政府办",
      "联系电话": "64353229"
    },
    {
      "单位名称": "市人大",
      "联系电话": "64353612"
    },
    {
      "单位名称": "宣传部、新闻宣传中心",
      "联系电话": "64353946"
    },
    {
      "单位名称": "武装部",
      "联系电话": "64353860"
    },
    {
      "单位名称": "发展改革委",
      "联系电话": "64353419"
    },
    {
      "单位名称": "财政局",
      "联系电话": "64353929"
    },
    {
      "单位名称": "河务局",
      "联系电话": "56337922"
    },
    {
      "单位名称": "监察局",
      "联系电话": "64353948"
    },
    {
      "单位名称": "公安局",
      "联系电话": "64598110"
    },
    {
      "单位名称": "安监局",
      "联系电话": "64369589"
    },
    {
      "单位名称": "城建局",
      "联系电话": "64351021"
    },
    {
      "单位名称": "国土局",
      "联系电话": "64351413"
    },
    {
      "单位名称": "交通局",
      "联系电话": "64352291"
    },
    {
      "单位名称": "科工信委",
      "联系电话": "64381019"
    },
    {
      "单位名称": "民政局",
      "联系电话": "64353616"
    },
    {
      "单位名称": "人社局",
      "联系电话": "64351606"
    },
    {
      "单位名称": "园林绿化",
      "联系电话": "68533155"
    },
    {
      "单位名称": "司法局",
      "联系电话": "64386016"
    },
    {
      "单位名称": "农委",
      "联系电话": "64351917"
    },
    {
      "单位名称": "林业局",
      "联系电话": "64353910"
    },
    {
      "单位名称": "气象局",
      "联系电话": "64352391"
    },
    {
      "单位名称": "粮食局",
      "联系电话": "64353913"
    },
    {
      "单位名称": "卫生局",
      "联系电话": "64353492"
    },
    {
      "单位名称": "教体局",
      "联系电话": "64353032"
    },
    {
      "单位名称": "文广新闻局",
      "联系电话": "66558811"
    },
    {
      "单位名称": "煤炭局",
      "联系电话": "64353189"
    },
    {
      "单位名称": "陆泽管理局",
      "联系电话": "60267855（白） 60267809（晚）"
    },
    {
      "单位名称": "文物旅游局",
      "联系电话": "64352375"
    },
    {
      "单位名称": "供销社",
      "联系电话": "64352447"
    },
    {
      "单位名称": "电业局",
      "联系电话": "64593216"
    },
    {
      "单位名称": "水务公司",
      "联系电话": "64351336"
    },
    {
      "单位名称": "信用联社",
      "联系电话": "64351062"
    },
    {
      "单位名称": "商业总公司",
      "联系电话": "64352965"
    },
    {
      "单位名称": "外贸物资总公司",
      "联系电话": "64318786"
    },
    {
      "单位名称": "石油公司",
      "联系电话": "66552518"
    },
    {
      "单位名称": "邮政局",
      "联系电话": "64568600"
    },
    {
      "单位名称": "移动公司",
      "联系电话": "13592689005"
    },
    {
      "单位名称": "联通公司",
      "联系电话": "66555550"
    },
    {
      "单位名称": "回廊消防办",
      "联系电话": "64234121"
    },
    {
      "单位名称": "芝田镇防办",
      "联系电话": "68532699 64108699"
    },
    {
      "单位名称": "杜甫街道办事处防办",
      "联系电话": "64598005 64598007"
    },
    {
      "单位名称": "孝义街道办事处防办",
      "联系电话": "64351027 64350535"
    },
    {
      "单位名称": "康店镇防办",
      "联系电话": "64324003"
    },
    {
      "单位名称": "河洛镇防办",
      "联系电话": "64157057 64156717"
    },
    {
      "单位名称": "站街镇防办",
      "联系电话": "64426003 64426553"
    }
  ],
                "ryzyfa": [
                    {"desc": "东明镇故县水库库区高水位紧急避险群众转移安置计划表", "vaule": [
                        {"村庄名称": "祁寸村", "迁移路线": "--", "迁移时间": "--", "安置点名称": "县城",
                         "负责单位": "--"},
                        {"村庄名称": "北苏村", "迁移路线": "--", "迁移时间": "--", "安置点名称": "县城",
                         "负责单位": "--"},
                        {"村庄名称": "北苏村", "迁移路线": "--", "迁移时间": "--", "安置点名称": "县城",
                         "负责单位": "--"}]},
                    {"desc": "范里镇故县水库库区高水位紧急避险群众转移安置计划表", "vaule": [
                        {"村庄名称": "苗村", "迁移路线": "--", "迁移时间": "--", "安置点名称": "县城",
                         "负责单位": "--"},
                        {"村庄名称": "东寨", "迁移路线": "--", "迁移时间": "--", "安置点名称": "村室",
                         "负责单位": "--"},
                        {"村庄名称": "留村", "迁移路线": "--", "迁移时间": "--", "安置点名称": "村室",
                         "负责单位": "--"},
                        {"村庄名称": "新庄村", "迁移路线": "--", "迁移时间": "--", "安置点名称": "村室",
                         "负责单位": "--"}]},
                    {"desc": "饭坡镇陆浑水库库区高水位紧急避险群众转移安置计划表", "vaule": [
                        {"村庄名称": "南庄村", "迁移路线": "--", "迁移时间": "--", "安置点名称": "陆浑服务区",
                         "负责单位": "李岩虹13937957098"},
                        {"村庄名称": "干涧沟村", "迁移路线": "村道", "迁移时间": "--", "安置点名称": "--",
                         "负责单位": "李玉梅13838890229"},
                        {"村庄名称": "曲里村", "迁移路线": "嵩汝路至文化大院", "迁移时间": "--",
                         "安置点名称": "文化大院", "负责单位": "张习习19939850560"}]},
                    {"desc": "陆浑镇陆浑水库库区高水位紧急避险群众转移安置计划表", "vaule": [
                        {"村庄名称": "桥北村", "迁移路线": "老洛栾路和快速通道", "迁移时间": "--",
                         "安置点名称": "桥北村剧院", "负责单位": "乡镇领导梁少波15978669069"},
                        {"村庄名称": "万安村", "迁移路线": "村道", "迁移时间": "--", "安置点名称": "万安村村委",
                         "负责单位": "乡镇领导梁少波15978669069"},
                        {"村庄名称": "柏坡村", "迁移路线": "村道", "迁移时间": "--", "安置点名称": "老樊店村委",
                         "负责单位": "乡镇领导梁少波15978669069"},
                        {"村庄名称": "梁园", "迁移路线": "村道", "迁移时间": "--", "安置点名称": "老村部",
                         "负责单位": "乡镇领导任纪锋13721618818"},
                        {"村庄名称": "翟河村", "迁移路线": "村道", "迁移时间": "--", "安置点名称": "小学",
                         "负责单位": "乡镇领导任纪锋13721618818"},
                        {"村庄名称": "望城岗", "迁移路线": "村道", "迁移时间": "--", "安置点名称": "望城岗村委",
                         "负责单位": "乡镇领导任纪锋13721618818"},
                        {"村庄名称": "楼上村", "迁移路线": "村道", "迁移时间": "--", "安置点名称": "楼上小学",
                         "负责单位": "乡镇领导任袁园1529051277"},
                        {"村庄名称": "牛寨村", "迁移路线": "村道", "迁移时间": "--", "安置点名称": "新便民服务部",
                         "负责单位": "乡镇领导任袁园1529051277"},
                        {"村庄名称": "汪庄村", "迁移路线": "村道", "迁移时间": "--", "安置点名称": "玉皇山路口",
                         "负责单位": "乡镇领导任袁园1529051277"},
                        {"村庄名称": "和店村", "迁移路线": "村道", "迁移时间": "--", "安置点名称": "和店坡上",
                         "负责单位": "乡镇领导刘娟娟18737915013"},
                        {"村庄名称": "岗上村", "迁移路线": "村道", "迁移时间": "--", "安置点名称": "岗上小学",
                         "负责单位": "乡镇领导刘娟娟18737915013"},
                        {"村庄名称": "寺庄村", "迁移路线": "村道", "迁移时间": "--", "安置点名称": "寺坡庄上",
                         "负责单位": "乡镇领导刘娟娟18737915013"},
                        {"村庄名称": "龙驹村", "迁移路线": "村道", "迁移时间": "--", "安置点名称": "龙驹小学",
                         "负责单位": "乡镇领导温作圣18338892151"},
                        {"村庄名称": "板闸店村", "迁移路线": "老洛栾路和快速通道", "迁移时间": "--",
                         "安置点名称": "板闸店村委", "负责单位": "乡镇领导王琳18037359686"},
                        {"村庄名称": "草寺沟村", "迁移路线": "沿坡路线", "迁移时间": "--", "安置点名称": "学校",
                         "负责单位": "乡镇领导李江峰13838483838"},
                        {"村庄名称": "上坡村", "迁移路线": "沿坡路线", "迁移时间": "--", "安置点名称": "一组后坡",
                         "负责单位": "乡镇领导李江峰13838483838"},
                        {"村庄名称": "吴村", "迁移路线": "小学主干道", "迁移时间": "--", "安置点名称": "吴村小学",
                         "负责单位": "乡镇领导陶凯17772134158"}]},
                    {"desc": "伊洛河偃师段淹没范围内群众撤离路线", "vaule": [
                        {
                            "村庄名称": "喂南 喂北 西谷 东谷堤头 后马郡",
                            "迁移路线": "由岳佃路往北经 310 国道、杜甫大道向北转移",
                            "迁移时间": "2小时",
                            "安置点名称": "油店 牙庄 关窑 张窑  光明 马洼",
                            "负责单位": "岳滩镇政府及相关村委"
                        },
                        {
                            "村庄名称": "尚庄 佛滩头 周堂 黄大王庙 仝庄赵庄街 赵庄寨 王庄 东庄 前马郡 寇圪当岳滩",
                            "迁移路线": "由岳安路往东经 310 国道、杜甫大道向南转移",
                            "迁移时间": "2小时",
                            "安置点名称": "程子沟 布村 马河 李 寨 坞官庄 缑氏 王湾 郑 金屯 扒头 滹沱",
                            "负责单位": "岳滩镇政府及相关村委"
                        },
                        {
                            "村庄名称": "前李 四角楼 圪当头 二里头 北许西洼 东洼",
                            "迁移路线": "由岳佃路往西上 207 国道向北转移",
                            "迁移时间": "2小时",
                            "安置点名称": "刘坡 东蔡庄 西蔡庄 赵坡 杨兰庄 省庄 牛庄 牛新 吉沟 周山 丁门口",
                            "负责单位": "翟镇镇政府及相关村委"
                        },
                        {
                            "村庄名称": "田西 田北 田中 宁北 宁南 翟西 翟东 前王 卧龙 王七 甄庄 大炉庄",
                            "迁移路线": "由岳安路上 207 国道向南转移",
                            "迁移时间": "2小时",
                            "安置点名称": "郭村 温村 韩村 草庙 铁村 马村 董村 大口 焦村 吕桥 西寨 肖村 曹寨",
                            "负责单位": "翟镇镇政府及相关村委"
                        },
                        {
                            "村庄名称": "安滩杨村 曲家寨(枣庄)",
                            "迁移路线": "向本镇安全地带转移",
                            "迁移时间": "2小时",
                            "安置点名称": "安滩 回龙湾",
                            "负责单位": "顾县镇政府及相关村委"
                        },
                        {
                            "村庄名称": "后庄 东寺庄 西寺庄 北关 许庄 齐庄 北窑",
                            "迁移路线": "就近道路经市区向北转移",
                            "迁移时间": "2小时",
                            "安置点名称": "新新 新城 北窑 窑头 槐庙",
                            "负责单位": "伊洛街道办、槐新街道办及相关村委会"
                        },
                        {
                            "村庄名称": "前杜楼新寨塔庄",
                            "迁移路线": "往北过 310 国道向北转移",
                            "迁移时间": "2小时",
                            "安置点名称": "杏园石硖",
                            "负责单位": "商城街道办"
                        },
                        {
                            "村庄名称": "城东 前纸庄 前张 后纸庄 古城",
                            "迁移路线": "往北过 310 国道向北转移",
                            "迁移时间": "2小时",
                            "安置点名称": "沟口头 香玉 石桥 坟庄 寨后 ",
                            "负责单位": "首阳山街道办及相关村委"
                        },
                        {
                            "村庄名称": "渔古 义井 龙虎滩",
                            "迁移路线": "往北过 310 国道向北转移",
                            "迁移时间": "2小时",
                            "安置点名称": "羊二庄 寺里碑 韩旗 保庄",
                            "负责单位": "首阳山街道办及相关村委"
                        },
                        {
                            "村庄名称": "王窑",
                            "迁移路线": "向本镇安全地带转移",
                            "迁移时间": "2小时",
                            "安置点名称": "王窑",
                            "负责单位": "山化镇政府及相关村委"
                        }
                    ]},
                    {"desc": "伊洛河巩义段淹没范围内群众撤离路线", "vaule": [
                        {
                            "村庄名称": "干沟",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "本村高地",
                            "负责单位": "回郭镇"
                        },
                        {
                            "村庄名称": "柴沟",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "本村高地",
                            "负责单位": "回郭镇"
                        },
                        {
                            "村庄名称": "柏玉",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "本村高地",
                            "负责单位": "回郭镇"
                        },
                        {
                            "村庄名称": "刘村",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2楼顶，3 南部丘陵",
                            "负责单位": "回郭镇"
                        },
                        {
                            "村庄名称": "杨庄",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2楼顶，3 南部丘陵",
                            "负责单位": "回郭镇"
                        },
                        {
                            "村庄名称": "李邵",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2楼顶，3 南部丘陵",
                            "负责单位": "回郭镇"
                        },
                        {
                            "村庄名称": "北寺",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2楼顶，3 南部丘陵",
                            "负责单位": "回郭镇"
                        },
                        {
                            "村庄名称": "马口",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2南部丘陵",
                            "负责单位": "回郭镇"
                        },
                        {
                            "村庄名称": "东庙",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2南部丘陵",
                            "负责单位": "回郭镇"
                        },
                        {
                            "村庄名称": "北罗",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2 南部丘陵",
                            "负责单位": "回郭镇"
                        },
                        {
                            "村庄名称": "南罗",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2南部丘陵",
                            "负责单位": "回郭镇"
                        },
                        {
                            "村庄名称": "清西",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2南部丘陵",
                            "负责单位": "回郭镇"
                        },
                        {
                            "村庄名称": "清中",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2南部丘陵",
                            "负责单位": "回郭镇"
                        },
                        {
                            "村庄名称": "清东",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2南部丘陵",
                            "负责单位": "回郭镇"
                        },
                        {
                            "村庄名称": "小訾殿",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "本村高地",
                            "负责单位": "回郭镇"
                        },
                        {
                            "村庄名称": "稍柴",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "本村高地",
                            "负责单位": "芝田镇"
                        },
                        {
                            "村庄名称": "寇家湾",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "本村高地",
                            "负责单位": "芝田镇"
                        },
                        {
                            "村庄名称": "二十里",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2东部地区",
                            "负责单位": "孝义办"
                        },
                        {
                            "村庄名称": "孝南",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2东部地区",
                            "负责单位": "孝义办"
                        },
                        {
                            "村庄名称": "孝北",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2东部地区",
                            "负责单位": "孝义办"
                        },
                        {
                            "村庄名称": "桥上",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2东部地区",
                            "负责单位": "孝义办"
                        },
                        {
                            "村庄名称": "小沟",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2东部地区",
                            "负责单位": "孝义办"
                        },
                        {
                            "村庄名称": "烈江沟",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2东部地区",
                            "负责单位": "孝义办"
                        },
                        {
                            "村庄名称": "石灰务",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2东部地区",
                            "负责单位": "孝义办"
                        },
                        {
                            "村庄名称": "龙尾",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "1本村高地，2东部地区",
                            "负责单位": "孝义办"
                        },
                        {
                            "村庄名称": "仓西",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "贺尧村区",
                            "负责单位": "站街镇"
                        },
                        {
                            "村庄名称": "东站镇",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "东部丘陵",
                            "负责单位": "站街镇"
                        },
                        {
                            "村庄名称": "北窑湾",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "东部丘陵",
                            "负责单位": "站街镇"
                        },
                        {
                            "村庄名称": "康南",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "西部邙陵",
                            "负责单位": "康店镇"
                        },
                        {
                            "村庄名称": "康北",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "西部邙陵",
                            "负责单位": "康店镇"
                        },
                        {
                            "村庄名称": "焦湾",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "西部邙陵",
                            "负责单位": "康店镇"
                        },
                        {
                            "村庄名称": "礼泉",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "西部邙陵",
                            "负责单位": "康店镇"
                        },
                        {
                            "村庄名称": "庄头",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "西部邙陵",
                            "负责单位": "康店镇"
                        },
                        {
                            "村庄名称": "水峪",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "北部邙陵",
                            "负责单位": "河洛镇"
                        },
                        {
                            "村庄名称": "蔡沟",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "北部邙陵",
                            "负责单位": "河洛镇"
                        },
                        {
                            "村庄名称": "五龙",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "北部邙陵",
                            "负责单位": "河洛镇"
                        },
                        {
                            "村庄名称": "古桥",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "北部邙陵",
                            "负责单位": "河洛镇"
                        },
                        {
                            "村庄名称": "庙门",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "北部邙陵",
                            "负责单位": "河洛镇"
                        },
                        {
                            "村庄名称": "石关",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "北部邙陵",
                            "负责单位": "河洛镇"
                        },
                        {
                            "村庄名称": "寺湾",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "北部邙陵",
                            "负责单位": "河洛镇"
                        },
                        {
                            "村庄名称": "南河渡",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "北部邙陵",
                            "负责单位": "河洛镇"
                        },
                        {
                            "村庄名称": "神南",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "西部邙陵",
                            "负责单位": "河洛镇"
                        },
                        {
                            "村庄名称": "神北",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "西部邙陵",
                            "负责单位": "河洛镇"
                        },
                        {
                            "村庄名称": "七里铺",
                            "迁移路线": "--",
                            "迁移时间": "--",
                            "安置点名称": "东部邙陵",
                            "负责单位": "河洛镇"
                        }
                    ]}
                ]
}
    
    def getJiangYuYuBaoData(self):
        """
            降雨预报
        """
        print("YLH getJiangYuYuBaoData")
        return {}
    
    def getDiaoDuFangAnData(self):
        """
            调度方案
        """
        # print("YLH getDiaoDuFangAnData")
        auth_token = get_access_token(base_url="http://10.4.158.35:8091")
        # print("auth_token:", auth_token)
        status, dataJson = get_ddfad_data(auth_token=auth_token,base_url="http://10.4.158.35:8091")
        logger.info(f"dataJson:{dataJson}")
        if dataJson['code'] != 200:
            logger.error("获取调度方案失败,使用默认JSON数据生成调度方案单！！！")
            with open("data/examples/ddfad.json", mode="r", encoding="utf-8") as json_file:
                dataJson = json.load(json_file)
        datalist = dataJson['data']['skdd']
        # 读取Excel文件
        import openpyxl
        workbook = openpyxl.load_workbook("data/yuan_templet/ddfad.xlsx")
        # 时间	三门峡				小浪底				陆浑				故县				河口村				龙门镇	白马寺	黑石关	花园口
        # 时间	水位	蓄量	入库	出库	水位	蓄量	入库	出库	水位	蓄量	入库	出库	水位	蓄量	入库	出库	水位	蓄量	入库	出库	流量	流量	流量	流量
        keylist = ['dateTime', 
                   'sanmenxiaShuiwei', 'sanmenxiaXuliang', 'sanmenxiaRuku', 'sanmenxiaChuku',
                   'xiaolangdiShuiwei','xiaolangdiXuliang','xiaolangdiRuku','xiaolangdiChuku',
                   'luhunShuiwei','luhunXuliang','luhunRuku','luhunChuku',
                   'guxianShuiwei','guxianXuliang','guxianRuku','guxianChuku',
                   'hekoucunShuiwei','hekoucunXuliang','hekoucunRuku','hekoucunChuku',
                   'longmenzhenLiuliang', 'baimasiLiuliang', 'heishiguanLiuliang', 'huayuankouLiuliang'
                ]
        # 获取活动工作表
        sheet = workbook.active
        # 遍历数据并逐行追加到工作表中
        for data in datalist:
            row =[data.get(key, 0) for key in keylist]
            # 往EXCEL写入，从第一列开始
            sheet.append(row)
        ddfadFilePath = f"data/yuan_data/4/ddfad/{self.date}.xlsx"
        workbook.save(ddfadFilePath)
        logger.info(ddfadFilePath, "保存成功")
        return {}

    def getGongChengYanPanData(self):
        """
            工程研判
        """
        print("YLH getGongChengYanPanData")
        return {}
    
    def getShuNiuYingYongData(self):
        """
            枢纽运用方案
        """
        print("YLH getShuNiuYingYongData")
        return {}

    def getAnQuanJuChuoData(self):
        """
            安全举措
        """
        print("YLH getAnQuanJuChuoData")
        return {}
    
    def buildJsonData(self):
        super().buildJsonData()

if __name__ == "__main__":
    YLHDataFactory(dataType=4).buildJsonData()
    # YLHDataFactory(dataType=4).getDiaoDuFangAnData()
    pass